Repository: DalavanCloud/spamassassin
Catalog: debian/po/*.po
Languages: fr, ja

source: As of 2.40-1, spamproxyd is no longer available. (This was an upstream decision.) It appears that spamproxyd is not currently running; however, this check may not be totally accurate. If you do use spamproxyd, you will need to find an alternative, or download it from SpamAssassin CVS.
fr: Depuis la version 2.40-1, spamproxyd n'est plus disponible (sur décision du mainteneur amont). En ce moment, il semble que spamproxyd ne soit pas en train de fonctionner. Cependant, la vérification effectuée n'est pas complètement fiable. Si vous utilisez bel et bien spamproxyd, vous devez trouver un autre mode de fonctionnement ou télécharger spamproxyd sur le CVS de SpamAssassin.
ja: 2.40-1 では、spamproxyd はもう利用できません (これは upstream の決定によるものです)。spamproxyd は現在実行されていないと思われます。しかし、このチェックは完全に正確であるというわけではありません。もし spamproxyd を使うのであれば、別のものを探すか、あるいは SpamAssassin の CVS からそれをダウンロードする必要があります。

source: Major changes to SpamAssassin mail stream integration
fr: Changements importants pour l'intégration de SpamAssassin dans le flux de courrier
ja: SpamAssassin のメールストリーム統合での大きな変更

source: As of version 2.40-1, spamproxyd is no longer available. (This was an upstream decision) It appears that spamproxyd is running, therefore, it is likely that this will cause problems. You will need to find another way of calling spamassassin, or download spamproxyd from SpamAssassin CVS. (http://www.spamassassin.org for more information)
fr: Depuis la version 2.40-1, spamproxyd n'est plus disponible (sur décision du mainteneur amont). En ce moment, il semble que spamproxyd soit en train de fonctionner ce qui va probablement générer des dysfonctionnements. Vous devez utiliser une autre méthode pour lancer spamassassin ou télécharger spamproxyd sur le CVS de SpamAssassin. Veuillez consulter http://www.spamassassin.org pour plus d'informations.
ja: 2.40-1 では、spamproxyd はもう利用できません (これは upstream の決定によるものです)。spamproxyd は現在実行されているようですが、これは問題を引き起こすでしょう。spamassassin を呼び出す別の方法を探すか、あるいは SpamAssassin の CVS からspamproxyd をダウンロードする必要があります (詳細については http://www.spamassassin.org を参照)。

source: spamassassin now takes the -P argument by default to act as a pipe instead of doing local delivery. If you have been using spamassassin (without the -P argument) to do local delivery, you will need to fix your mail stream manually. (If you are calling spamassassin via procmail, you can probably ignore this.)
fr: Spamassassin utilise désormais le commutateur -P par défaut afin d'être utilisé comme filtre (« pipe ») plutôt que comme agent local de distribution du courrier. Si, pour la distribution locale, vous utilisez spamassassin sans le commutateur -P, vous aurez à reconfigurer votre flux de courrier manuellement. Si vous utilisez spamassassin depuis procmail, vous pouvez sans risque ignorer cet avertissement.
ja: spamassassin は現在、デフォルトでローカル配送を行う代わりにパイプするための -P 引数を取ります。spamassassin をローカル配送に (-P 引数なしで) 使っている場合、メールストリームを手動で修正する必要があります (procmail 経由で spamassassin を呼び出している場合にはおそらくこれは無視してかまいません)。

source: You will be given an option to abort the installation.
fr: Vous allez avoir une occasion d'interrompre l'installation.
ja: インストールを中止するという選択肢が与えられます。

source: Delete config files in /etc/spamassassin?
fr: Supprimer les fichiers de configuration dans /etc/spamassassin ?
ja: /etc/spamassassin にある設定ファイルを削除しますか?

source: As of 2.42-1, rules files for spamassassin will be placed in /usr/share/spamassassin because of a tighter relationship between rule files and the version of spamassassin. You currently have configuration files in /etc/spamassassin. Would you like all of these out of date configuration files to be deleted? If you don't, you will probably need to do this yourself, or you will get many warnings. If you do, you may lose some local changes.
fr: Depuis la version 2.42-1, les fichiers de règles pour spamassassin sont placés dans /usr/share/spamassassin car ils sont plus directement dépendants de la version de spamassassin. Vous avez actuellement des fichiers de règles dans /etc/spamassassin. Voulez-vous effacer tous ces fichiers de configuration obsolètes ? Si vous refusez, vous aurez probablement à le faire vous-même sous peine de voir s'afficher de nombreux avertissements. Si vous acceptez, il est possible que certaines modifications locales soient perdues.
ja: 2.42-1 では、spamassassin のルールファイルは、ルールファイルと spamassassin のバージョンとの間に強い関係があることから /usr/share/spamassassin に置かれます。/etc/spamassassin に設定ファイルが現在存在するようです。これらの過去の設定ファイルすべてを削除しますか? もしそうしないなら、おそらくこれをあなた自身で行う必要があり、あるいは多くの警告を受け取ることになります。削除する場合には、いくつかのローカルの変更を失うことになります。

source: Yes, No
fr: Oui, Non
ja: はい, いいえ

source: Delete out of date config files in /etc/spamassassin?
fr: Supprimer les fichiers périmés dans /etc/spamassassin ?
ja: /etc/spamassassin にある過去の設定ファイルを削除しますか?

source: As of 2.42-1, rules files for spamassassin will be placed in /usr/share/spamassassin because of a tighter relationship between rule files and the version of spamassassin. You have not modified these files, so you will not lose any local changes. Would you like all out of date configuration files deleted? If you don't, you will probably need to do this yourself, or you will get many warnings.
fr: Depuis la version 2.42-1, les fichiers de règles pour spamassassin sont placés dans /usr/share/spamassassin car ils sont plus directement dépendants de la version de spamassassin. Vous n'avez pas modifié ces fichiers et ne perdrez donc pas de modifications locales. Voulez-vous effacer tous les fichiers de configuration obsolètes ? Si vous refusez, vous aurez probablement à le faire vous-même sous peine de voir s'afficher de nombreux avertissements.
ja: 2.42-1 では、spamassassin のルールファイルは、ルールファイルと spamassassin のバージョンとの間に強い関係があることから /usr/share/spamassassin に置かれます。これらのファイルを変更していないようなので、ローカルの変更が失われることはありません。これらの過去の設定ファイルすべてを削除しますか? もしそうしないなら、おそらくこれをあなた自身で行う必要があり、あるいは多くの警告を受け取ることになります。

source: Continue, Cancel
fr: Continuer, Abandonner
ja: 続ける, キャンセル

source: There may be errors on the upgrade.
fr: Des erreurs sont possibles pendant la mise à jour.
ja: 更新時にエラーが発生するかもしれません。

source: As previously indicated, you may experience errors after this upgrade. You may cancel now, and fix the problem, or you may continue.
fr: Comme cela a été signalé auparavant, vous pourriez être confronté à des erreurs lors de la mise à jour. Vous pouvez abandonner maintenant et corriger le problème ou continuer la mise à jour.
ja: 以前に示したとおり、この更新後にエラーを経験するかもしれません。今キャンセルして問題を修正するか、続けることができます。
